tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
extern volatile FCMDSTR _FCMD @(REG_BASE + 0x00000106UL);
#define FCMD                            _FCMD.Byte
#define FCMD_CMDB0                      _FCMD.Bits.CMDB0
#define FCMD_CMDB2                      _FCMD.Bits.CMDB2
#define FCMD_CMDB5                      _FCMD.Bits.CMDB5
#define FCMD_CMDB6                      _FCMD.Bits.CMDB6
#define FCMD_CMDB_5                     _FCMD.MergedBits.grpCMDB_5
#define FCMD_CMDB                       FCMD_CMDB_5

#define FCMD_CMDB0_MASK                 0x01U
#define FCMD_CMDB2_MASK                 0x04U
#define FCMD_CMDB5_MASK                 0x20U
#define FCMD_CMDB6_MASK                 0x40U
#define FCMD_CMDB_5_MASK                0x60U
#define FCMD_CMDB_5_BITNUM              0x05U


/*** EPHYCTL0 - Ethernet Physical Transceiver Control Register 0; 0x00000120 ***/
typedef union {
  byte Byte;
  struct {
    byte EPHYIEN     :1;                                       /* EPHY Interrupt Enable */
    byte             :1; 
    byte EPHYWAI     :1;                                       /* EPHY Module Stops While in Wait */
    byte LEDEN       :1;                                       /* LED Drive Enable */
    byte DIS10       :1;                                       /* Disable 10BaseT PLL */
    byte DIS100      :1;                                       /* Disable 100 Base-TX PLL */
    byte ANDIS       :1;                                       /* Auto Negotiation Disable */
    byte EPHYEN      :1;                                       /* EPHY Enable */
  } Bits;
} EPHYCTL0STR;
extern volatile EPHYCTL0STR _EPHYCTL0 @(REG_BASE + 0x00000120UL);
#define EPHYCTL0                        _EPHYCTL0.Byte
#define EPHYCTL0_EPHYIEN                _EPHYCTL0.Bits.EPHYIEN
#define EPHYCTL0_EPHYWAI                _EPHYCTL0.Bits.EPHYWAI
#define EPHYCTL0_LEDEN                  _EPHYCTL0.Bits.LEDEN
#define EPHYCTL0_DIS10                  _EPHYCTL0.Bits.DIS10
#define EPHYCTL0_DIS100                 _EPHYCTL0.Bits.DIS100
#define EPHYCTL0_ANDIS                  _EPHYCTL0.Bits.ANDIS
#define EPHYCTL0_EPHYEN                 _EPHYCTL0.Bits.EPHYEN
/* EPHYCTL_ARR: Access 2 EPHYCTLx registers in an array */
#define EPHYCTL_ARR                     ((volatile byte *) &EPHYCTL0)

#define EPHYCTL0_EPHYIEN_MASK           0x01U
#define EPHYCTL0_EPHYWAI_MASK           0x04U
#define EPHYCTL0_LEDEN_MASK             0x08U
#define EPHYCTL0_DIS10_MASK             0x10U
#define EPHYCTL0_DIS100_MASK            0x20U
#define EPHYCTL0_ANDIS_MASK             0x40U
#define EPHYCTL0_EPHYEN_MASK            0x80U


/*** EPHYCTL1 - Ethernet Physical Transceiver Control Register 1; 0x00000121 ***/
typedef union {
  byte Byte;
  struct {
    byte PHYADD0     :1;                                       /* EPHY Address for MII Request Bit 0 */
    byte PHYADD1     :1;                                       /* EPHY Address for MII Request Bit 1 */
    byte PHYADD2     :1;                                       /* EPHY Address for MII Request Bit 2 */
    byte PHYADD3     :1;                                       /* EPHY Address for MII Request Bit 3 */
    byte PHYADD4     :1;                                       /* EPHY Address for MII Request Bit 4 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPHYADD :5;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} EPHYCTL1STR;
extern volatile EPHYCTL1STR _EPHYCTL1 @(REG_BASE + 0x00000121UL);
#define EPHYCTL1                        _EPHYCTL1.Byte
#define EPHYCTL1_PHYADD0                _EPHYCTL1.Bits.PHYADD0
#define EPHYCTL1_PHYADD1                _EPHYCTL1.Bits.PHYADD1
#define EPHYCTL1_PHYADD2                _EPHYCTL1.Bits.PHYADD2
#define EPHYCTL1_PHYADD3                _EPHYCTL1.Bits.PHYADD3
#define EPHYCTL1_PHYADD4                _EPHYCTL1.Bits.PHYADD4
#define EPHYCTL1_PHYADD                 _EPHYCTL1.MergedBits.grpPHYADD

#define EPHYCTL1_PHYADD0_MASK           0x01U
#define EPHYCTL1_PHYADD1_MASK           0x02U
#define EPHYCTL1_PHYADD2_MASK           0x04U
#define EPHYCTL1_PHYADD3_MASK           0x08U
#define EPHYCTL1_PHYADD4_MASK           0x10U
#define EPHYCTL1_PHYADD_MASK            0x1FU
#define EPHYCTL1_PHYADD_BITNUM          0x00U


/*** EPHYSR - Ethernet Physical Transceiver Status Register; 0x00000122 ***/
typedef union {
  byte Byte;
  struct {
    byte EPHYIF      :1;                                       /* EPHY Interrupt Flag */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte _10DIS      :1;                                       /* EPHY Port Base 10X mode status */
    byte _100DIS     :1;                                       /* EPHY Port Base 100X mode status */
    byte             :1; 
    byte             :1; 
  } Bits;
} EPHYSRSTR;
extern volatile EPHYSRSTR _EPHYSR @(REG_BASE + 0x00000122UL);
#define EPHYSR                          _EPHYSR.Byte
#define EPHYSR_EPHYIF                   _EPHYSR.Bits.EPHYIF
#define EPHYSR__10DIS                   _EPHYSR.Bits._10DIS
#define EPHYSR__100DIS                  _EPHYSR.Bits._100DIS

#define EPHYSR_EPHYIF_MASK              0x01U
#define EPHYSR__10DIS_MASK              0x10U
#define EPHYSR__100DIS_MASK             0x20U


/*** NETCTL - Network Control; 0x00000140 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte FDX         :1;                                       /* Full Duplex */
    byte MLB         :1;                                       /* MAC Loopback */
    byte EXTPHY      :1;                                       /* External PHY */
    byte ESWAI       :1;                                       /* EMAC Disabled during WAIT Mode */
    byte             :1; 
    byte             :1; 
    byte EMACE       :1;                                       /* EMAC Enable */
  } Bits;
} NETCTLSTR;
extern volatile NETCTLSTR _NETCTL @(REG_BASE + 0x00000140UL);
#define NETCTL                          _NETCTL.Byte
#define NETCTL_FDX                      _NETCTL.Bits.FDX
#define NETCTL_MLB                      _NETCTL.Bits.MLB
#define NETCTL_EXTPHY                   _NETCTL.Bits.EXTPHY
#define NETCTL_ESWAI                    _NETCTL.Bits.ESWAI
#define NETCTL_EMACE                    _NETCTL.Bits.EMACE

#define NETCTL_FDX_MASK                 0x02U
#define NETCTL_MLB_MASK                 0x04U
#define NETCTL_EXTPHY_MASK              0x08U
#define NETCTL_ESWAI_MASK               0x10U
#define NETCTL_EMACE_MASK               0x80U


