tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
extern volatile PTIMESTR _PTIME @(REG_BASE + 0x00000148UL);
#define PTIME                           _PTIME.Word
#define PTIME_PTIME0                    _PTIME.Bits.PTIME0
#define PTIME_PTIME1                    _PTIME.Bits.PTIME1
#define PTIME_PTIME2                    _PTIME.Bits.PTIME2
#define PTIME_PTIME3                    _PTIME.Bits.PTIME3
#define PTIME_PTIME4                    _PTIME.Bits.PTIME4
#define PTIME_PTIME5                    _PTIME.Bits.PTIME5
#define PTIME_PTIME6                    _PTIME.Bits.PTIME6
#define PTIME_PTIME7                    _PTIME.Bits.PTIME7
#define PTIME_PTIME8                    _PTIME.Bits.PTIME8
#define PTIME_PTIME9                    _PTIME.Bits.PTIME9
#define PTIME_PTIME10                   _PTIME.Bits.PTIME10
#define PTIME_PTIME11                   _PTIME.Bits.PTIME11
#define PTIME_PTIME12                   _PTIME.Bits.PTIME12
#define PTIME_PTIME13                   _PTIME.Bits.PTIME13
#define PTIME_PTIME14                   _PTIME.Bits.PTIME14
#define PTIME_PTIME15                   _PTIME.Bits.PTIME15

#define PTIME_PTIME0_MASK               0x01U
#define PTIME_PTIME1_MASK               0x02U
#define PTIME_PTIME2_MASK               0x04U
#define PTIME_PTIME3_MASK               0x08U
#define PTIME_PTIME4_MASK               0x10U
#define PTIME_PTIME5_MASK               0x20U
#define PTIME_PTIME6_MASK               0x40U
#define PTIME_PTIME7_MASK               0x80U
#define PTIME_PTIME8_MASK               0x0100U
#define PTIME_PTIME9_MASK               0x0200U
#define PTIME_PTIME10_MASK              0x0400U
#define PTIME_PTIME11_MASK              0x0800U
#define PTIME_PTIME12_MASK              0x1000U
#define PTIME_PTIME13_MASK              0x2000U
#define PTIME_PTIME14_MASK              0x4000U
#define PTIME_PTIME15_MASK              0x8000U


/*** IEVENT - Interrupt Event; 0x0000014A ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word TXCIF       :1;                                       /* Frame Transmission Complete Interrupt Flag */
    word             :1; 
    word             :1; 
    word ECIF        :1;                                       /* Excessive Collision Interrupt Flag */
    word LCIF        :1;                                       /* Late Collision Interrupt Flag */
    word             :1; 
    word MMCIF       :1;                                       /* MII Management Transfer Complete Interrupt Flag */
    word RXBCIF      :1;                                       /* Valid Frame Reception to Receive Buffer B Complete Interrupt Flag */
    word RXACIF      :1;                                       /* Valid Frame Reception to Receive Buffer A Complete Interrupt Flag */
    word RXBOIF      :1;                                       /* Receive Buffer B Overrun Interrupt Flag */
    word RXAOIF      :1;                                       /* Receive Buffer A Overrun Interrupt Flag */
    word RXEIF       :1;                                       /* Receive Error Interrupt Flag */
    word BREIF       :1;                                       /* Babbling Receive Error Interrupt Flag */
    word             :1; 
    word RFCIF       :1;                                       /* Receive Flow Control Interrupt Flag */
  } Bits;
} IEVENTSTR;
extern volatile IEVENTSTR _IEVENT @(REG_BASE + 0x0000014AUL);
#define IEVENT                          _IEVENT.Word
#define IEVENT_TXCIF                    _IEVENT.Bits.TXCIF
#define IEVENT_ECIF                     _IEVENT.Bits.ECIF
#define IEVENT_LCIF                     _IEVENT.Bits.LCIF
#define IEVENT_MMCIF                    _IEVENT.Bits.MMCIF
#define IEVENT_RXBCIF                   _IEVENT.Bits.RXBCIF
#define IEVENT_RXACIF                   _IEVENT.Bits.RXACIF
#define IEVENT_RXBOIF                   _IEVENT.Bits.RXBOIF
#define IEVENT_RXAOIF                   _IEVENT.Bits.RXAOIF
#define IEVENT_RXEIF                    _IEVENT.Bits.RXEIF
#define IEVENT_BREIF                    _IEVENT.Bits.BREIF
#define IEVENT_RFCIF                    _IEVENT.Bits.RFCIF

#define IEVENT_TXCIF_MASK               0x02U
#define IEVENT_ECIF_MASK                0x10U
#define IEVENT_LCIF_MASK                0x20U
#define IEVENT_MMCIF_MASK               0x80U
#define IEVENT_RXBCIF_MASK              0x0100U
#define IEVENT_RXACIF_MASK              0x0200U
#define IEVENT_RXBOIF_MASK              0x0400U
#define IEVENT_RXAOIF_MASK              0x0800U
#define IEVENT_RXEIF_MASK               0x1000U
#define IEVENT_BREIF_MASK               0x2000U
#define IEVENT_RFCIF_MASK               0x8000U


/*** IMASK - Interrupt Mask; 0x0000014C ***/
typedef union {
  word Word;
  struct {
    word             :1; 
    word TXCIE       :1;                                       /* Frame Transmission Complete Interrupt Enable */
    word             :1; 
    word             :1; 
    word ECIE        :1;                                       /* Excessive Collision Interrupt Enable */
    word LCIE        :1;                                       /* Late Collision Interrupt Enable */
    word             :1; 
    word MMCIE       :1;                                       /* MII Management Transfer Complete Interrupt Enable */
    word RXBCIE      :1;                                       /* Valid Frame Reception to Receive Buffer B Complete Interrupt Enable */
    word RXACIE      :1;                                       /* Valid Frame Reception to Receive Buffer A Complete Interrupt Enable */
    word RXBOIE      :1;                                       /* Receive Buffer B Overrun Interrupt Enable */
    word RXAOIE      :1;                                       /* Receive Buffer A Overrun Interrupt Enable */
    word RXEIE       :1;                                       /* Receive Error Interrupt Enable */
    word BREIE       :1;                                       /* Babbling Receive Error Interrupt Enable */
    word             :1; 
    word RFCIE       :1;                                       /* Receive Flow Control Interrupt Enable */
  } Bits;
} IMASKSTR;
extern volatile IMASKSTR _IMASK @(REG_BASE + 0x0000014CUL);
#define IMASK                           _IMASK.Word
#define IMASK_TXCIE                     _IMASK.Bits.TXCIE
#define IMASK_ECIE                      _IMASK.Bits.ECIE
#define IMASK_LCIE                      _IMASK.Bits.LCIE
#define IMASK_MMCIE                     _IMASK.Bits.MMCIE
#define IMASK_RXBCIE                    _IMASK.Bits.RXBCIE
#define IMASK_RXACIE                    _IMASK.Bits.RXACIE
#define IMASK_RXBOIE                    _IMASK.Bits.RXBOIE
#define IMASK_RXAOIE                    _IMASK.Bits.RXAOIE
#define IMASK_RXEIE                     _IMASK.Bits.RXEIE
#define IMASK_BREIE                     _IMASK.Bits.BREIE
#define IMASK_RFCIE                     _IMASK.Bits.RFCIE

