tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
/*** MRDATA - MII Read Data; 0x00000154 ***/
typedef union {
  word Word;
  struct {
    word RDATA0      :1;                                       /* MII Read Data Bit 0 */
    word RDATA1      :1;                                       /* MII Read Data Bit 1 */
    word RDATA2      :1;                                       /* MII Read Data Bit 2 */
    word RDATA3      :1;                                       /* MII Read Data Bit 3 */
    word RDATA4      :1;                                       /* MII Read Data Bit 4 */
    word RDATA5      :1;                                       /* MII Read Data Bit 5 */
    word RDATA6      :1;                                       /* MII Read Data Bit 6 */
    word RDATA7      :1;                                       /* MII Read Data Bit 7 */
    word RDATA8      :1;                                       /* MII Read Data Bit 8 */
    word RDATA9      :1;                                       /* MII Read Data Bit 9 */
    word RDATA10     :1;                                       /* MII Read Data Bit 10 */
    word RDATA11     :1;                                       /* MII Read Data Bit 11 */
    word RDATA12     :1;                                       /* MII Read Data Bit 12 */
    word RDATA13     :1;                                       /* MII Read Data Bit 13 */
    word RDATA14     :1;                                       /* MII Read Data Bit 14 */
    word RDATA15     :1;                                       /* MII Read Data Bit 15 */
  } Bits;
} MRDATASTR;
extern volatile MRDATASTR _MRDATA @(REG_BASE + 0x00000154UL);
#define MRDATA                          _MRDATA.Word
#define MRDATA_RDATA0                   _MRDATA.Bits.RDATA0
#define MRDATA_RDATA1                   _MRDATA.Bits.RDATA1
#define MRDATA_RDATA2                   _MRDATA.Bits.RDATA2
#define MRDATA_RDATA3                   _MRDATA.Bits.RDATA3
#define MRDATA_RDATA4                   _MRDATA.Bits.RDATA4
#define MRDATA_RDATA5                   _MRDATA.Bits.RDATA5
#define MRDATA_RDATA6                   _MRDATA.Bits.RDATA6
#define MRDATA_RDATA7                   _MRDATA.Bits.RDATA7
#define MRDATA_RDATA8                   _MRDATA.Bits.RDATA8
#define MRDATA_RDATA9                   _MRDATA.Bits.RDATA9
#define MRDATA_RDATA10                  _MRDATA.Bits.RDATA10
#define MRDATA_RDATA11                  _MRDATA.Bits.RDATA11
#define MRDATA_RDATA12                  _MRDATA.Bits.RDATA12
#define MRDATA_RDATA13                  _MRDATA.Bits.RDATA13
#define MRDATA_RDATA14                  _MRDATA.Bits.RDATA14
#define MRDATA_RDATA15                  _MRDATA.Bits.RDATA15

#define MRDATA_RDATA0_MASK              0x01U
#define MRDATA_RDATA1_MASK              0x02U
#define MRDATA_RDATA2_MASK              0x04U
#define MRDATA_RDATA3_MASK              0x08U
#define MRDATA_RDATA4_MASK              0x10U
#define MRDATA_RDATA5_MASK              0x20U
#define MRDATA_RDATA6_MASK              0x40U
#define MRDATA_RDATA7_MASK              0x80U
#define MRDATA_RDATA8_MASK              0x0100U
#define MRDATA_RDATA9_MASK              0x0200U
#define MRDATA_RDATA10_MASK             0x0400U
#define MRDATA_RDATA11_MASK             0x0800U
#define MRDATA_RDATA12_MASK             0x1000U
#define MRDATA_RDATA13_MASK             0x2000U
#define MRDATA_RDATA14_MASK             0x4000U
#define MRDATA_RDATA15_MASK             0x8000U


/*** MCMST - MII Command and Status; 0x00000156 ***/
typedef union {
  byte Byte;
  struct {
    byte MDCSEL0     :1;                                       /* Management Clock Rate Select Bit 0 */
    byte MDCSEL1     :1;                                       /* Management Clock Rate Select Bit 1 */
    byte MDCSEL2     :1;                                       /* Management Clock Rate Select Bit 2 */
    byte MDCSEL3     :1;                                       /* Management Clock Rate Select Bit 3 */
    byte NOPRE       :1;                                       /* No Preamble */
    byte BUSY        :1;                                       /* Operation in Progress */
    byte OP0         :1;                                       /* Operation Code Bit 0 */
    byte OP1         :1;                                       /* Operation Code Bit 1 */
  } Bits;
  struct {
    byte grpMDCSEL :4;
    byte         :1;
    byte         :1;
    byte grpOP   :2;
  } MergedBits;
} MCMSTSTR;
extern volatile MCMSTSTR _MCMST @(REG_BASE + 0x00000156UL);
#define MCMST                           _MCMST.Byte
#define MCMST_MDCSEL0                   _MCMST.Bits.MDCSEL0
#define MCMST_MDCSEL1                   _MCMST.Bits.MDCSEL1
#define MCMST_MDCSEL2                   _MCMST.Bits.MDCSEL2
#define MCMST_MDCSEL3                   _MCMST.Bits.MDCSEL3
#define MCMST_NOPRE                     _MCMST.Bits.NOPRE
#define MCMST_BUSY                      _MCMST.Bits.BUSY
#define MCMST_OP0                       _MCMST.Bits.OP0
#define MCMST_OP1                       _MCMST.Bits.OP1
#define MCMST_MDCSEL                    _MCMST.MergedBits.grpMDCSEL
#define MCMST_OP                        _MCMST.MergedBits.grpOP

#define MCMST_MDCSEL0_MASK              0x01U
#define MCMST_MDCSEL1_MASK              0x02U
#define MCMST_MDCSEL2_MASK              0x04U
#define MCMST_MDCSEL3_MASK              0x08U
#define MCMST_NOPRE_MASK                0x10U
#define MCMST_BUSY_MASK                 0x20U
#define MCMST_OP0_MASK                  0x40U
#define MCMST_OP1_MASK                  0x80U
#define MCMST_MDCSEL_MASK               0x0FU
#define MCMST_MDCSEL_BITNUM             0x00U
#define MCMST_OP_MASK                   0xC0U
#define MCMST_OP_BITNUM                 0x06U


/*** BUFCFG - FIFO Buffer Configuration; 0x00000158 ***/
typedef union {
  word Word;
  struct {
    word MAXFL0      :1;                                       /* Receive Maximum Frame Length Bit 0 */
    word MAXFL1      :1;                                       /* Receive Maximum Frame Length Bit 1 */
    word MAXFL2      :1;                                       /* Receive Maximum Frame Length Bit 2 */
    word MAXFL3      :1;                                       /* Receive Maximum Frame Length Bit 3 */
    word MAXFL4      :1;                                       /* Receive Maximum Frame Length Bit 4 */
    word MAXFL5      :1;                                       /* Receive Maximum Frame Length Bit 5 */
    word MAXFL6      :1;                                       /* Receive Maximum Frame Length Bit 6 */
    word MAXFL7      :1;                                       /* Receive Maximum Frame Length Bit 7 */
    word MAXFL8      :1;                                       /* Receive Maximum Frame Length Bit 8 */
    word MAXFL9      :1;                                       /* Receive Maximum Frame Length Bit 9 */
    word MAXFL10     :1;                                       /* Receive Maximum Frame Length Bit 10 */
    word             :1; 
    word BUFMAP0     :1;                                       /* Buffer Size and Starting Address Mapping Bit 0 */
    word BUFMAP1     :1;                                       /* Buffer Size and Starting Address Mapping Bit 1 */
    word BUFMAP2     :1;                                       /* Buffer Size and Starting Address Mapping Bit 2 */
    word BUFMAP3     :1;                                       /* Buffer Size and Starting Address Mapping Bit 3 */
  } Bits;
  struct {
    word grpMAXFL :11;
    word         :1;
    word grpBUFMAP :4;
  } MergedBits;
} BUFCFGSTR;
extern volatile BUFCFGSTR _BUFCFG @(REG_BASE + 0x00000158UL);
#define BUFCFG                          _BUFCFG.Word
#define BUFCFG_MAXFL0                   _BUFCFG.Bits.MAXFL0
#define BUFCFG_MAXFL1                   _BUFCFG.Bits.MAXFL1
#define BUFCFG_MAXFL2                   _BUFCFG.Bits.MAXFL2
#define BUFCFG_MAXFL3                   _BUFCFG.Bits.MAXFL3
#define BUFCFG_MAXFL4                   _BUFCFG.Bits.MAXFL4
#define BUFCFG_MAXFL5                   _BUFCFG.Bits.MAXFL5
#define BUFCFG_MAXFL6                   _BUFCFG.Bits.MAXFL6
#define BUFCFG_MAXFL7                   _BUFCFG.Bits.MAXFL7
#define BUFCFG_MAXFL8                   _BUFCFG.Bits.MAXFL8
#define BUFCFG_MAXFL9                   _BUFCFG.Bits.MAXFL9
#define BUFCFG_MAXFL10                  _BUFCFG.Bits.MAXFL10
#define BUFCFG_BUFMAP0                  _BUFCFG.Bits.BUFMAP0
#define BUFCFG_BUFMAP1                  _BUFCFG.Bits.BUFMAP1
#define BUFCFG_BUFMAP2                  _BUFCFG.Bits.BUFMAP2
#define BUFCFG_BUFMAP3                  _BUFCFG.Bits.BUFMAP3
#define BUFCFG_MAXFL                    _BUFCFG.MergedBits.grpMAXFL
#define BUFCFG_BUFMAP                   _BUFCFG.MergedBits.grpBUFMAP

#define BUFCFG_MAXFL0_MASK              0x01U
#define BUFCFG_MAXFL1_MASK              0x02U
#define BUFCFG_MAXFL2_MASK              0x04U
#define BUFCFG_MAXFL3_MASK              0x08U
#define BUFCFG_MAXFL4_MASK              0x10U
#define BUFCFG_MAXFL5_MASK              0x20U
#define BUFCFG_MAXFL6_MASK              0x40U
#define BUFCFG_MAXFL7_MASK              0x80U
#define BUFCFG_MAXFL8_MASK              0x0100U
#define BUFCFG_MAXFL9_MASK              0x0200U
#define BUFCFG_MAXFL10_MASK             0x0400U
#define BUFCFG_BUFMAP0_MASK             0x1000U
#define BUFCFG_BUFMAP1_MASK             0x2000U
#define BUFCFG_BUFMAP2_MASK             0x4000U
#define BUFCFG_BUFMAP3_MASK             0x8000U
#define BUFCFG_MAXFL_MASK               0x07FFU
#define BUFCFG_MAXFL_BITNUM             0x00U
#define BUFCFG_BUFMAP_MASK              0xF000U
#define BUFCFG_BUFMAP_BITNUM            0x0CU


/*** RXAEFP - Receive A End of Frame Pointer; 0x0000015A ***/
typedef union {
  word Word;
  struct {
    word RXAEFP0     :1;                                       /* Receive A End of Frame Pointer Bit 0 */
    word RXAEFP1     :1;                                       /* Receive A End of Frame Pointer Bit 1 */
    word RXAEFP2     :1;                                       /* Receive A End of Frame Pointer Bit 2 */
    word RXAEFP3     :1;                                       /* Receive A End of Frame Pointer Bit 3 */
    word RXAEFP4     :1;                                       /* Receive A End of Frame Pointer Bit 4 */
    word RXAEFP5     :1;                                       /* Receive A End of Frame Pointer Bit 5 */
    word RXAEFP6     :1;                                       /* Receive A End of Frame Pointer Bit 6 */
    word RXAEFP7     :1;                                       /* Receive A End of Frame Pointer Bit 7 */
    word RXAEFP8     :1;                                       /* Receive A End of Frame Pointer Bit 8 */
    word RXAEFP9     :1;                                       /* Receive A End of Frame Pointer Bit 9 */
    word RXAEFP10    :1;                                       /* Receive A End of Frame Pointer Bit 10 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpRXAEFP :11;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} RXAEFPSTR;
