tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
extern volatile RXAEFPSTR _RXAEFP @(REG_BASE + 0x0000015AUL);
#define RXAEFP                          _RXAEFP.Word
#define RXAEFP_RXAEFP0                  _RXAEFP.Bits.RXAEFP0
#define RXAEFP_RXAEFP1                  _RXAEFP.Bits.RXAEFP1
#define RXAEFP_RXAEFP2                  _RXAEFP.Bits.RXAEFP2
#define RXAEFP_RXAEFP3                  _RXAEFP.Bits.RXAEFP3
#define RXAEFP_RXAEFP4                  _RXAEFP.Bits.RXAEFP4
#define RXAEFP_RXAEFP5                  _RXAEFP.Bits.RXAEFP5
#define RXAEFP_RXAEFP6                  _RXAEFP.Bits.RXAEFP6
#define RXAEFP_RXAEFP7                  _RXAEFP.Bits.RXAEFP7
#define RXAEFP_RXAEFP8                  _RXAEFP.Bits.RXAEFP8
#define RXAEFP_RXAEFP9                  _RXAEFP.Bits.RXAEFP9
#define RXAEFP_RXAEFP10                 _RXAEFP.Bits.RXAEFP10
#define RXAEFP_RXAEFP                   _RXAEFP.MergedBits.grpRXAEFP

#define RXAEFP_RXAEFP0_MASK             0x01U
#define RXAEFP_RXAEFP1_MASK             0x02U
#define RXAEFP_RXAEFP2_MASK             0x04U
#define RXAEFP_RXAEFP3_MASK             0x08U
#define RXAEFP_RXAEFP4_MASK             0x10U
#define RXAEFP_RXAEFP5_MASK             0x20U
#define RXAEFP_RXAEFP6_MASK             0x40U
#define RXAEFP_RXAEFP7_MASK             0x80U
#define RXAEFP_RXAEFP8_MASK             0x0100U
#define RXAEFP_RXAEFP9_MASK             0x0200U
#define RXAEFP_RXAEFP10_MASK            0x0400U
#define RXAEFP_RXAEFP_MASK              0x07FFU
#define RXAEFP_RXAEFP_BITNUM            0x00U


/*** RXBEFP - Receive B End of Frame Pointer; 0x0000015C ***/
typedef union {
  word Word;
  struct {
    word RXBEFP0     :1;                                       /* Receive B End of Frame Pointer Bit 0 */
    word RXBEFP1     :1;                                       /* Receive B End of Frame Pointer Bit 1 */
    word RXBEFP2     :1;                                       /* Receive B End of Frame Pointer Bit 2 */
    word RXBEFP3     :1;                                       /* Receive B End of Frame Pointer Bit 3 */
    word RXBEFP4     :1;                                       /* Receive B End of Frame Pointer Bit 4 */
    word RXBEFP5     :1;                                       /* Receive B End of Frame Pointer Bit 5 */
    word RXBEFP6     :1;                                       /* Receive B End of Frame Pointer Bit 6 */
    word RXBEFP7     :1;                                       /* Receive B End of Frame Pointer Bit 7 */
    word RXBEFP8     :1;                                       /* Receive B End of Frame Pointer Bit 8 */
    word RXBEFP9     :1;                                       /* Receive B End of Frame Pointer Bit 9 */
    word RXBEFP10    :1;                                       /* Receive B End of Frame Pointer Bit 10 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpRXBEFP :11;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} RXBEFPSTR;
extern volatile RXBEFPSTR _RXBEFP @(REG_BASE + 0x0000015CUL);
#define RXBEFP                          _RXBEFP.Word
#define RXBEFP_RXBEFP0                  _RXBEFP.Bits.RXBEFP0
#define RXBEFP_RXBEFP1                  _RXBEFP.Bits.RXBEFP1
#define RXBEFP_RXBEFP2                  _RXBEFP.Bits.RXBEFP2
#define RXBEFP_RXBEFP3                  _RXBEFP.Bits.RXBEFP3
#define RXBEFP_RXBEFP4                  _RXBEFP.Bits.RXBEFP4
#define RXBEFP_RXBEFP5                  _RXBEFP.Bits.RXBEFP5
#define RXBEFP_RXBEFP6                  _RXBEFP.Bits.RXBEFP6
#define RXBEFP_RXBEFP7                  _RXBEFP.Bits.RXBEFP7
#define RXBEFP_RXBEFP8                  _RXBEFP.Bits.RXBEFP8
#define RXBEFP_RXBEFP9                  _RXBEFP.Bits.RXBEFP9
#define RXBEFP_RXBEFP10                 _RXBEFP.Bits.RXBEFP10
#define RXBEFP_RXBEFP                   _RXBEFP.MergedBits.grpRXBEFP

#define RXBEFP_RXBEFP0_MASK             0x01U
#define RXBEFP_RXBEFP1_MASK             0x02U
#define RXBEFP_RXBEFP2_MASK             0x04U
#define RXBEFP_RXBEFP3_MASK             0x08U
#define RXBEFP_RXBEFP4_MASK             0x10U
#define RXBEFP_RXBEFP5_MASK             0x20U
#define RXBEFP_RXBEFP6_MASK             0x40U
#define RXBEFP_RXBEFP7_MASK             0x80U
#define RXBEFP_RXBEFP8_MASK             0x0100U
#define RXBEFP_RXBEFP9_MASK             0x0200U
#define RXBEFP_RXBEFP10_MASK            0x0400U
#define RXBEFP_RXBEFP_MASK              0x07FFU
#define RXBEFP_RXBEFP_BITNUM            0x00U


/*** TXEFP - Transmit End of Frame Pointer; 0x0000015E ***/
typedef union {
  word Word;
  struct {
    word TXEFP0      :1;                                       /* Transmit End of Frame Pointer Bit 0 */
    word TXEFP1      :1;                                       /* Transmit End of Frame Pointer Bit 1 */
    word TXEFP2      :1;                                       /* Transmit End of Frame Pointer Bit 2 */
    word TXEFP3      :1;                                       /* Transmit End of Frame Pointer Bit 3 */
    word TXEFP4      :1;                                       /* Transmit End of Frame Pointer Bit 4 */
    word TXEFP5      :1;                                       /* Transmit End of Frame Pointer Bit 5 */
    word TXEFP6      :1;                                       /* Transmit End of Frame Pointer Bit 6 */
    word TXEFP7      :1;                                       /* Transmit End of Frame Pointer Bit 7 */
    word TXEFP8      :1;                                       /* Transmit End of Frame Pointer Bit 8 */
    word TXEFP9      :1;                                       /* Transmit End of Frame Pointer Bit 9 */
    word TXEFP10     :1;                                       /* Transmit End of Frame Pointer Bit 10 */
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
    word             :1; 
  } Bits;
  struct {
    word grpTXEFP :11;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
    word         :1;
  } MergedBits;
} TXEFPSTR;
extern volatile TXEFPSTR _TXEFP @(REG_BASE + 0x0000015EUL);
#define TXEFP                           _TXEFP.Word
#define TXEFP_TXEFP0                    _TXEFP.Bits.TXEFP0
#define TXEFP_TXEFP1                    _TXEFP.Bits.TXEFP1
#define TXEFP_TXEFP2                    _TXEFP.Bits.TXEFP2
#define TXEFP_TXEFP3                    _TXEFP.Bits.TXEFP3
#define TXEFP_TXEFP4                    _TXEFP.Bits.TXEFP4
#define TXEFP_TXEFP5                    _TXEFP.Bits.TXEFP5
#define TXEFP_TXEFP6                    _TXEFP.Bits.TXEFP6
#define TXEFP_TXEFP7                    _TXEFP.Bits.TXEFP7
#define TXEFP_TXEFP8                    _TXEFP.Bits.TXEFP8
#define TXEFP_TXEFP9                    _TXEFP.Bits.TXEFP9
#define TXEFP_TXEFP10                   _TXEFP.Bits.TXEFP10
#define TXEFP_TXEFP                     _TXEFP.MergedBits.grpTXEFP

#define TXEFP_TXEFP0_MASK               0x01U
#define TXEFP_TXEFP1_MASK               0x02U
#define TXEFP_TXEFP2_MASK               0x04U
#define TXEFP_TXEFP3_MASK               0x08U
#define TXEFP_TXEFP4_MASK               0x10U
#define TXEFP_TXEFP5_MASK               0x20U
#define TXEFP_TXEFP6_MASK               0x40U
#define TXEFP_TXEFP7_MASK               0x80U
#define TXEFP_TXEFP8_MASK               0x0100U
#define TXEFP_TXEFP9_MASK               0x0200U
#define TXEFP_TXEFP10_MASK              0x0400U
#define TXEFP_TXEFP_MASK                0x07FFU
#define TXEFP_TXEFP_BITNUM              0x00U


/*** MCHASH3 - Multicast Hash Table Register 3; 0x00000160 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_48   :1;                                       /* Multicast Hash Table Index Bit 48 */
    word MCHASH_49   :1;                                       /* Multicast Hash Table Index Bit 49 */
    word MCHASH_50   :1;                                       /* Multicast Hash Table Index Bit 50 */
    word MCHASH_51   :1;                                       /* Multicast Hash Table Index Bit 51 */
    word MCHASH_52   :1;                                       /* Multicast Hash Table Index Bit 52 */
    word MCHASH_53   :1;                                       /* Multicast Hash Table Index Bit 53 */
    word MCHASH_54   :1;                                       /* Multicast Hash Table Index Bit 54 */
    word MCHASH_55   :1;                                       /* Multicast Hash Table Index Bit 55 */
    word MCHASH_56   :1;                                       /* Multicast Hash Table Index Bit 56 */
    word MCHASH_57   :1;                                       /* Multicast Hash Table Index Bit 57 */
    word MCHASH_58   :1;                                       /* Multicast Hash Table Index Bit 58 */
    word MCHASH_59   :1;                                       /* Multicast Hash Table Index Bit 59 */
    word MCHASH_60   :1;                                       /* Multicast Hash Table Index Bit 60 */
    word MCHASH_61   :1;                                       /* Multicast Hash Table Index Bit 61 */
    word MCHASH_62   :1;                                       /* Multicast Hash Table Index Bit 62 */
    word MCHASH_63   :1;                                       /* Multicast Hash Table Index Bit 63 */
  } Bits;
} MCHASH3STR;
extern volatile MCHASH3STR _MCHASH3 @(REG_BASE + 0x00000160UL);
#define MCHASH3                         _MCHASH3.Word
#define MCHASH3_MCHASH_48               _MCHASH3.Bits.MCHASH_48
#define MCHASH3_MCHASH_49               _MCHASH3.Bits.MCHASH_49
#define MCHASH3_MCHASH_50               _MCHASH3.Bits.MCHASH_50
#define MCHASH3_MCHASH_51               _MCHASH3.Bits.MCHASH_51
#define MCHASH3_MCHASH_52               _MCHASH3.Bits.MCHASH_52
#define MCHASH3_MCHASH_53               _MCHASH3.Bits.MCHASH_53
#define MCHASH3_MCHASH_54               _MCHASH3.Bits.MCHASH_54
#define MCHASH3_MCHASH_55               _MCHASH3.Bits.MCHASH_55
#define MCHASH3_MCHASH_56               _MCHASH3.Bits.MCHASH_56
#define MCHASH3_MCHASH_57               _MCHASH3.Bits.MCHASH_57
#define MCHASH3_MCHASH_58               _MCHASH3.Bits.MCHASH_58
#define MCHASH3_MCHASH_59               _MCHASH3.Bits.MCHASH_59
#define MCHASH3_MCHASH_60               _MCHASH3.Bits.MCHASH_60
#define MCHASH3_MCHASH_61               _MCHASH3.Bits.MCHASH_61
#define MCHASH3_MCHASH_62               _MCHASH3.Bits.MCHASH_62
#define MCHASH3_MCHASH_63               _MCHASH3.Bits.MCHASH_63

#define MCHASH3_MCHASH_48_MASK          0x01U
#define MCHASH3_MCHASH_49_MASK          0x02U
#define MCHASH3_MCHASH_50_MASK          0x04U
#define MCHASH3_MCHASH_51_MASK          0x08U
#define MCHASH3_MCHASH_52_MASK          0x10U
#define MCHASH3_MCHASH_53_MASK          0x20U
#define MCHASH3_MCHASH_54_MASK          0x40U
#define MCHASH3_MCHASH_55_MASK          0x80U
#define MCHASH3_MCHASH_56_MASK          0x0100U
#define MCHASH3_MCHASH_57_MASK          0x0200U
#define MCHASH3_MCHASH_58_MASK          0x0400U
#define MCHASH3_MCHASH_59_MASK          0x0800U
#define MCHASH3_MCHASH_60_MASK          0x1000U
#define MCHASH3_MCHASH_61_MASK          0x2000U
#define MCHASH3_MCHASH_62_MASK          0x4000U
#define MCHASH3_MCHASH_63_MASK          0x8000U


