tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
/*** MCHASH2 - Multicast Hash Table Register 2; 0x00000162 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_32   :1;                                       /* Multicast Hash Table Index Bit 32 */
    word MCHASH_33   :1;                                       /* Multicast Hash Table Index Bit 33 */
    word MCHASH_34   :1;                                       /* Multicast Hash Table Index Bit 34 */
    word MCHASH_35   :1;                                       /* Multicast Hash Table Index Bit 35 */
    word MCHASH_36   :1;                                       /* Multicast Hash Table Index Bit 36 */
    word MCHASH_37   :1;                                       /* Multicast Hash Table Index Bit 37 */
    word MCHASH_38   :1;                                       /* Multicast Hash Table Index Bit 38 */
    word MCHASH_39   :1;                                       /* Multicast Hash Table Index Bit 39 */
    word MCHASH_40   :1;                                       /* Multicast Hash Table Index Bit 40 */
    word MCHASH_41   :1;                                       /* Multicast Hash Table Index Bit 41 */
    word MCHASH_42   :1;                                       /* Multicast Hash Table Index Bit 42 */
    word MCHASH_43   :1;                                       /* Multicast Hash Table Index Bit 43 */
    word MCHASH_44   :1;                                       /* Multicast Hash Table Index Bit 44 */
    word MCHASH_45   :1;                                       /* Multicast Hash Table Index Bit 45 */
    word MCHASH_46   :1;                                       /* Multicast Hash Table Index Bit 46 */
    word MCHASH_47   :1;                                       /* Multicast Hash Table Index Bit 47 */
  } Bits;
} MCHASH2STR;
extern volatile MCHASH2STR _MCHASH2 @(REG_BASE + 0x00000162UL);
#define MCHASH2                         _MCHASH2.Word
#define MCHASH2_MCHASH_32               _MCHASH2.Bits.MCHASH_32
#define MCHASH2_MCHASH_33               _MCHASH2.Bits.MCHASH_33
#define MCHASH2_MCHASH_34               _MCHASH2.Bits.MCHASH_34
#define MCHASH2_MCHASH_35               _MCHASH2.Bits.MCHASH_35
#define MCHASH2_MCHASH_36               _MCHASH2.Bits.MCHASH_36
#define MCHASH2_MCHASH_37               _MCHASH2.Bits.MCHASH_37
#define MCHASH2_MCHASH_38               _MCHASH2.Bits.MCHASH_38
#define MCHASH2_MCHASH_39               _MCHASH2.Bits.MCHASH_39
#define MCHASH2_MCHASH_40               _MCHASH2.Bits.MCHASH_40
#define MCHASH2_MCHASH_41               _MCHASH2.Bits.MCHASH_41
#define MCHASH2_MCHASH_42               _MCHASH2.Bits.MCHASH_42
#define MCHASH2_MCHASH_43               _MCHASH2.Bits.MCHASH_43
#define MCHASH2_MCHASH_44               _MCHASH2.Bits.MCHASH_44
#define MCHASH2_MCHASH_45               _MCHASH2.Bits.MCHASH_45
#define MCHASH2_MCHASH_46               _MCHASH2.Bits.MCHASH_46
#define MCHASH2_MCHASH_47               _MCHASH2.Bits.MCHASH_47

#define MCHASH2_MCHASH_32_MASK          0x01U
#define MCHASH2_MCHASH_33_MASK          0x02U
#define MCHASH2_MCHASH_34_MASK          0x04U
#define MCHASH2_MCHASH_35_MASK          0x08U
#define MCHASH2_MCHASH_36_MASK          0x10U
#define MCHASH2_MCHASH_37_MASK          0x20U
#define MCHASH2_MCHASH_38_MASK          0x40U
#define MCHASH2_MCHASH_39_MASK          0x80U
#define MCHASH2_MCHASH_40_MASK          0x0100U
#define MCHASH2_MCHASH_41_MASK          0x0200U
#define MCHASH2_MCHASH_42_MASK          0x0400U
#define MCHASH2_MCHASH_43_MASK          0x0800U
#define MCHASH2_MCHASH_44_MASK          0x1000U
#define MCHASH2_MCHASH_45_MASK          0x2000U
#define MCHASH2_MCHASH_46_MASK          0x4000U
#define MCHASH2_MCHASH_47_MASK          0x8000U


/*** MCHASH1 - Multicast Hash Table Register 1; 0x00000164 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_16   :1;                                       /* Multicast Hash Table Index Bit 16 */
    word MCHASH_17   :1;                                       /* Multicast Hash Table Index Bit 17 */
    word MCHASH_18   :1;                                       /* Multicast Hash Table Index Bit 18 */
    word MCHASH_19   :1;                                       /* Multicast Hash Table Index Bit 19 */
    word MCHASH_20   :1;                                       /* Multicast Hash Table Index Bit 20 */
    word MCHASH_21   :1;                                       /* Multicast Hash Table Index Bit 21 */
    word MCHASH_22   :1;                                       /* Multicast Hash Table Index Bit 22 */
    word MCHASH_23   :1;                                       /* Multicast Hash Table Index Bit 23 */
    word MCHASH_24   :1;                                       /* Multicast Hash Table Index Bit 24 */
    word MCHASH_25   :1;                                       /* Multicast Hash Table Index Bit 25 */
    word MCHASH_26   :1;                                       /* Multicast Hash Table Index Bit 26 */
    word MCHASH_27   :1;                                       /* Multicast Hash Table Index Bit 27 */
    word MCHASH_28   :1;                                       /* Multicast Hash Table Index Bit 28 */
    word MCHASH_29   :1;                                       /* Multicast Hash Table Index Bit 29 */
    word MCHASH_30   :1;                                       /* Multicast Hash Table Index Bit 30 */
    word MCHASH_31   :1;                                       /* Multicast Hash Table Index Bit 31 */
  } Bits;
} MCHASH1STR;
extern volatile MCHASH1STR _MCHASH1 @(REG_BASE + 0x00000164UL);
#define MCHASH1                         _MCHASH1.Word
#define MCHASH1_MCHASH_16               _MCHASH1.Bits.MCHASH_16
#define MCHASH1_MCHASH_17               _MCHASH1.Bits.MCHASH_17
#define MCHASH1_MCHASH_18               _MCHASH1.Bits.MCHASH_18
#define MCHASH1_MCHASH_19               _MCHASH1.Bits.MCHASH_19
#define MCHASH1_MCHASH_20               _MCHASH1.Bits.MCHASH_20
#define MCHASH1_MCHASH_21               _MCHASH1.Bits.MCHASH_21
#define MCHASH1_MCHASH_22               _MCHASH1.Bits.MCHASH_22
#define MCHASH1_MCHASH_23               _MCHASH1.Bits.MCHASH_23
#define MCHASH1_MCHASH_24               _MCHASH1.Bits.MCHASH_24
#define MCHASH1_MCHASH_25               _MCHASH1.Bits.MCHASH_25
#define MCHASH1_MCHASH_26               _MCHASH1.Bits.MCHASH_26
#define MCHASH1_MCHASH_27               _MCHASH1.Bits.MCHASH_27
#define MCHASH1_MCHASH_28               _MCHASH1.Bits.MCHASH_28
#define MCHASH1_MCHASH_29               _MCHASH1.Bits.MCHASH_29
#define MCHASH1_MCHASH_30               _MCHASH1.Bits.MCHASH_30
#define MCHASH1_MCHASH_31               _MCHASH1.Bits.MCHASH_31

#define MCHASH1_MCHASH_16_MASK          0x01U
#define MCHASH1_MCHASH_17_MASK          0x02U
#define MCHASH1_MCHASH_18_MASK          0x04U
#define MCHASH1_MCHASH_19_MASK          0x08U
#define MCHASH1_MCHASH_20_MASK          0x10U
#define MCHASH1_MCHASH_21_MASK          0x20U
#define MCHASH1_MCHASH_22_MASK          0x40U
#define MCHASH1_MCHASH_23_MASK          0x80U
#define MCHASH1_MCHASH_24_MASK          0x0100U
#define MCHASH1_MCHASH_25_MASK          0x0200U
#define MCHASH1_MCHASH_26_MASK          0x0400U
#define MCHASH1_MCHASH_27_MASK          0x0800U
#define MCHASH1_MCHASH_28_MASK          0x1000U
#define MCHASH1_MCHASH_29_MASK          0x2000U
#define MCHASH1_MCHASH_30_MASK          0x4000U
#define MCHASH1_MCHASH_31_MASK          0x8000U


/*** MCHASH0 - Multicast Hash Table Register 0; 0x00000166 ***/
typedef union {
  word Word;
  struct {
    word MCHASH_0    :1;                                       /* Multicast Hash Table Index Bit 0 */
    word MCHASH_1    :1;                                       /* Multicast Hash Table Index Bit 1 */
    word MCHASH_2    :1;                                       /* Multicast Hash Table Index Bit 2 */
    word MCHASH_3    :1;                                       /* Multicast Hash Table Index Bit 3 */
    word MCHASH_4    :1;                                       /* Multicast Hash Table Index Bit 4 */
    word MCHASH_5    :1;                                       /* Multicast Hash Table Index Bit 5 */
    word MCHASH_6    :1;                                       /* Multicast Hash Table Index Bit 6 */
    word MCHASH_7    :1;                                       /* Multicast Hash Table Index Bit 7 */
    word MCHASH_8    :1;                                       /* Multicast Hash Table Index Bit 8 */
    word MCHASH_9    :1;                                       /* Multicast Hash Table Index Bit 9 */
    word MCHASH_10   :1;                                       /* Multicast Hash Table Index Bit 10 */
    word MCHASH_11   :1;                                       /* Multicast Hash Table Index Bit 11 */
    word MCHASH_12   :1;                                       /* Multicast Hash Table Index Bit 12 */
    word MCHASH_13   :1;                                       /* Multicast Hash Table Index Bit 13 */
    word MCHASH_14   :1;                                       /* Multicast Hash Table Index Bit 14 */
    word MCHASH_15   :1;                                       /* Multicast Hash Table Index Bit 15 */
  } Bits;
} MCHASH0STR;
extern volatile MCHASH0STR _MCHASH0 @(REG_BASE + 0x00000166UL);
#define MCHASH0                         _MCHASH0.Word
#define MCHASH0_MCHASH_0                _MCHASH0.Bits.MCHASH_0
#define MCHASH0_MCHASH_1                _MCHASH0.Bits.MCHASH_1
#define MCHASH0_MCHASH_2                _MCHASH0.Bits.MCHASH_2
#define MCHASH0_MCHASH_3                _MCHASH0.Bits.MCHASH_3
#define MCHASH0_MCHASH_4                _MCHASH0.Bits.MCHASH_4
#define MCHASH0_MCHASH_5                _MCHASH0.Bits.MCHASH_5
#define MCHASH0_MCHASH_6                _MCHASH0.Bits.MCHASH_6
#define MCHASH0_MCHASH_7                _MCHASH0.Bits.MCHASH_7
#define MCHASH0_MCHASH_8                _MCHASH0.Bits.MCHASH_8
#define MCHASH0_MCHASH_9                _MCHASH0.Bits.MCHASH_9
#define MCHASH0_MCHASH_10               _MCHASH0.Bits.MCHASH_10
#define MCHASH0_MCHASH_11               _MCHASH0.Bits.MCHASH_11
#define MCHASH0_MCHASH_12               _MCHASH0.Bits.MCHASH_12
#define MCHASH0_MCHASH_13               _MCHASH0.Bits.MCHASH_13
#define MCHASH0_MCHASH_14               _MCHASH0.Bits.MCHASH_14
#define MCHASH0_MCHASH_15               _MCHASH0.Bits.MCHASH_15

#define MCHASH0_MCHASH_0_MASK           0x01U
#define MCHASH0_MCHASH_1_MASK           0x02U
#define MCHASH0_MCHASH_2_MASK           0x04U
#define MCHASH0_MCHASH_3_MASK           0x08U
#define MCHASH0_MCHASH_4_MASK           0x10U
#define MCHASH0_MCHASH_5_MASK           0x20U
#define MCHASH0_MCHASH_6_MASK           0x40U
#define MCHASH0_MCHASH_7_MASK           0x80U
#define MCHASH0_MCHASH_8_MASK           0x0100U
#define MCHASH0_MCHASH_9_MASK           0x0200U
#define MCHASH0_MCHASH_10_MASK          0x0400U
#define MCHASH0_MCHASH_11_MASK          0x0800U
#define MCHASH0_MCHASH_12_MASK          0x1000U
#define MCHASH0_MCHASH_13_MASK          0x2000U
#define MCHASH0_MCHASH_14_MASK          0x4000U
#define MCHASH0_MCHASH_15_MASK          0x8000U


/*** MACAD2 - MAC Address Register 2; 0x00000168 ***/
typedef union {
  word Word;
  struct {
    word MACAD_32    :1;                                       /* MAC Address Bit 32 */
    word MACAD_33    :1;                                       /* MAC Address Bit 33 */
    word MACAD_34    :1;                                       /* MAC Address Bit 34 */
    word MACAD_35    :1;                                       /* MAC Address Bit 35 */
    word MACAD_36    :1;                                       /* MAC Address Bit 36 */
    word MACAD_37    :1;                                       /* MAC Address Bit 37 */
    word MACAD_38    :1;                                       /* MAC Address Bit 38 */
    word MACAD_39    :1;                                       /* MAC Address Bit 39 */
    word MACAD_40    :1;                                       /* MAC Address Bit 40 */
    word MACAD_41    :1;                                       /* MAC Address Bit 41 */
    word MACAD_42    :1;                                       /* MAC Address Bit 42 */
    word MACAD_43    :1;                                       /* MAC Address Bit 43 */
    word MACAD_44    :1;                                       /* MAC Address Bit 44 */
    word MACAD_45    :1;                                       /* MAC Address Bit 45 */
    word MACAD_46    :1;                                       /* MAC Address Bit 46 */
    word MACAD_47    :1;                                       /* MAC Address Bit 47 */
  } Bits;
} MACAD2STR;
