tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
extern volatile MACAD2STR _MACAD2 @(REG_BASE + 0x00000168UL);
#define MACAD2                          _MACAD2.Word
#define MACAD2_MACAD_32                 _MACAD2.Bits.MACAD_32
#define MACAD2_MACAD_33                 _MACAD2.Bits.MACAD_33
#define MACAD2_MACAD_34                 _MACAD2.Bits.MACAD_34
#define MACAD2_MACAD_35                 _MACAD2.Bits.MACAD_35
#define MACAD2_MACAD_36                 _MACAD2.Bits.MACAD_36
#define MACAD2_MACAD_37                 _MACAD2.Bits.MACAD_37
#define MACAD2_MACAD_38                 _MACAD2.Bits.MACAD_38
#define MACAD2_MACAD_39                 _MACAD2.Bits.MACAD_39
#define MACAD2_MACAD_40                 _MACAD2.Bits.MACAD_40
#define MACAD2_MACAD_41                 _MACAD2.Bits.MACAD_41
#define MACAD2_MACAD_42                 _MACAD2.Bits.MACAD_42
#define MACAD2_MACAD_43                 _MACAD2.Bits.MACAD_43
#define MACAD2_MACAD_44                 _MACAD2.Bits.MACAD_44
#define MACAD2_MACAD_45                 _MACAD2.Bits.MACAD_45
#define MACAD2_MACAD_46                 _MACAD2.Bits.MACAD_46
#define MACAD2_MACAD_47                 _MACAD2.Bits.MACAD_47

#define MACAD2_MACAD_32_MASK            0x01U
#define MACAD2_MACAD_33_MASK            0x02U
#define MACAD2_MACAD_34_MASK            0x04U
#define MACAD2_MACAD_35_MASK            0x08U
#define MACAD2_MACAD_36_MASK            0x10U
#define MACAD2_MACAD_37_MASK            0x20U
#define MACAD2_MACAD_38_MASK            0x40U
#define MACAD2_MACAD_39_MASK            0x80U
#define MACAD2_MACAD_40_MASK            0x0100U
#define MACAD2_MACAD_41_MASK            0x0200U
#define MACAD2_MACAD_42_MASK            0x0400U
#define MACAD2_MACAD_43_MASK            0x0800U
#define MACAD2_MACAD_44_MASK            0x1000U
#define MACAD2_MACAD_45_MASK            0x2000U
#define MACAD2_MACAD_46_MASK            0x4000U
#define MACAD2_MACAD_47_MASK            0x8000U


/*** MACAD1 - MAC Address Register 1; 0x0000016A ***/
typedef union {
  word Word;
  struct {
    word MACAD_16    :1;                                       /* MAC Address Bit 16 */
    word MACAD_17    :1;                                       /* MAC Address Bit 17 */
    word MACAD_18    :1;                                       /* MAC Address Bit 18 */
    word MACAD_19    :1;                                       /* MAC Address Bit 19 */
    word MACAD_20    :1;                                       /* MAC Address Bit 20 */
    word MACAD_21    :1;                                       /* MAC Address Bit 21 */
    word MACAD_22    :1;                                       /* MAC Address Bit 22 */
    word MACAD_23    :1;                                       /* MAC Address Bit 23 */
    word MACAD_24    :1;                                       /* MAC Address Bit 24 */
    word MACAD_25    :1;                                       /* MAC Address Bit 25 */
    word MACAD_26    :1;                                       /* MAC Address Bit 26 */
    word MACAD_27    :1;                                       /* MAC Address Bit 27 */
    word MACAD_28    :1;                                       /* MAC Address Bit 28 */
    word MACAD_29    :1;                                       /* MAC Address Bit 29 */
    word MACAD_30    :1;                                       /* MAC Address Bit 30 */
    word MACAD_31    :1;                                       /* MAC Address Bit 31 */
  } Bits;
} MACAD1STR;
extern volatile MACAD1STR _MACAD1 @(REG_BASE + 0x0000016AUL);
#define MACAD1                          _MACAD1.Word
#define MACAD1_MACAD_16                 _MACAD1.Bits.MACAD_16
#define MACAD1_MACAD_17                 _MACAD1.Bits.MACAD_17
#define MACAD1_MACAD_18                 _MACAD1.Bits.MACAD_18
#define MACAD1_MACAD_19                 _MACAD1.Bits.MACAD_19
#define MACAD1_MACAD_20                 _MACAD1.Bits.MACAD_20
#define MACAD1_MACAD_21                 _MACAD1.Bits.MACAD_21
#define MACAD1_MACAD_22                 _MACAD1.Bits.MACAD_22
#define MACAD1_MACAD_23                 _MACAD1.Bits.MACAD_23
#define MACAD1_MACAD_24                 _MACAD1.Bits.MACAD_24
#define MACAD1_MACAD_25                 _MACAD1.Bits.MACAD_25
#define MACAD1_MACAD_26                 _MACAD1.Bits.MACAD_26
#define MACAD1_MACAD_27                 _MACAD1.Bits.MACAD_27
#define MACAD1_MACAD_28                 _MACAD1.Bits.MACAD_28
#define MACAD1_MACAD_29                 _MACAD1.Bits.MACAD_29
#define MACAD1_MACAD_30                 _MACAD1.Bits.MACAD_30
#define MACAD1_MACAD_31                 _MACAD1.Bits.MACAD_31

#define MACAD1_MACAD_16_MASK            0x01U
#define MACAD1_MACAD_17_MASK            0x02U
#define MACAD1_MACAD_18_MASK            0x04U
#define MACAD1_MACAD_19_MASK            0x08U
#define MACAD1_MACAD_20_MASK            0x10U
#define MACAD1_MACAD_21_MASK            0x20U
#define MACAD1_MACAD_22_MASK            0x40U
#define MACAD1_MACAD_23_MASK            0x80U
#define MACAD1_MACAD_24_MASK            0x0100U
#define MACAD1_MACAD_25_MASK            0x0200U
#define MACAD1_MACAD_26_MASK            0x0400U
#define MACAD1_MACAD_27_MASK            0x0800U
#define MACAD1_MACAD_28_MASK            0x1000U
#define MACAD1_MACAD_29_MASK            0x2000U
#define MACAD1_MACAD_30_MASK            0x4000U
#define MACAD1_MACAD_31_MASK            0x8000U


/*** MACAD0 - MAC Address Register 0; 0x0000016C ***/
typedef union {
  word Word;
  struct {
    word MACAD_0     :1;                                       /* MAC Address Bit 0 */
    word MACAD_1     :1;                                       /* MAC Address Bit 1 */
    word MACAD_2     :1;                                       /* MAC Address Bit 2 */
    word MACAD_3     :1;                                       /* MAC Address Bit 3 */
    word MACAD_4     :1;                                       /* MAC Address Bit 4 */
    word MACAD_5     :1;                                       /* MAC Address Bit 5 */
    word MACAD_6     :1;                                       /* MAC Address Bit 6 */
    word MACAD_7     :1;                                       /* MAC Address Bit 7 */
    word MACAD_8     :1;                                       /* MAC Address Bit 8 */
    word MACAD_9     :1;                                       /* MAC Address Bit 9 */
    word MACAD_10    :1;                                       /* MAC Address Bit 10 */
    word MACAD_11    :1;                                       /* MAC Address Bit 11 */
    word MACAD_12    :1;                                       /* MAC Address Bit 12 */
    word MACAD_13    :1;                                       /* MAC Address Bit 13 */
    word MACAD_14    :1;                                       /* MAC Address Bit 14 */
    word MACAD_15    :1;                                       /* MAC Address Bit 15 */
  } Bits;
} MACAD0STR;
extern volatile MACAD0STR _MACAD0 @(REG_BASE + 0x0000016CUL);
#define MACAD0                          _MACAD0.Word
#define MACAD0_MACAD_0                  _MACAD0.Bits.MACAD_0
#define MACAD0_MACAD_1                  _MACAD0.Bits.MACAD_1
#define MACAD0_MACAD_2                  _MACAD0.Bits.MACAD_2
#define MACAD0_MACAD_3                  _MACAD0.Bits.MACAD_3
#define MACAD0_MACAD_4                  _MACAD0.Bits.MACAD_4
#define MACAD0_MACAD_5                  _MACAD0.Bits.MACAD_5
#define MACAD0_MACAD_6                  _MACAD0.Bits.MACAD_6
#define MACAD0_MACAD_7                  _MACAD0.Bits.MACAD_7
#define MACAD0_MACAD_8                  _MACAD0.Bits.MACAD_8
#define MACAD0_MACAD_9                  _MACAD0.Bits.MACAD_9
#define MACAD0_MACAD_10                 _MACAD0.Bits.MACAD_10
#define MACAD0_MACAD_11                 _MACAD0.Bits.MACAD_11
#define MACAD0_MACAD_12                 _MACAD0.Bits.MACAD_12
#define MACAD0_MACAD_13                 _MACAD0.Bits.MACAD_13
#define MACAD0_MACAD_14                 _MACAD0.Bits.MACAD_14
#define MACAD0_MACAD_15                 _MACAD0.Bits.MACAD_15

