tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
#define MACAD0_MACAD_0_MASK             0x01U
#define MACAD0_MACAD_1_MASK             0x02U
#define MACAD0_MACAD_2_MASK             0x04U
#define MACAD0_MACAD_3_MASK             0x08U
#define MACAD0_MACAD_4_MASK             0x10U
#define MACAD0_MACAD_5_MASK             0x20U
#define MACAD0_MACAD_6_MASK             0x40U
#define MACAD0_MACAD_7_MASK             0x80U
#define MACAD0_MACAD_8_MASK             0x0100U
#define MACAD0_MACAD_9_MASK             0x0200U
#define MACAD0_MACAD_10_MASK            0x0400U
#define MACAD0_MACAD_11_MASK            0x0800U
#define MACAD0_MACAD_12_MASK            0x1000U
#define MACAD0_MACAD_13_MASK            0x2000U
#define MACAD0_MACAD_14_MASK            0x4000U
#define MACAD0_MACAD_15_MASK            0x8000U


/*** EMISC - MAC Address Register 3; 0x0000016E ***/
typedef union {
  word Word;
  struct {
    word EMISC0      :1;                                       /* EMISC Bit 0 */
    word EMISC1      :1;                                       /* EMISC Bit 1 */
    word EMISC2      :1;                                       /* EMISC Bit 2 */
    word EMISC3      :1;                                       /* EMISC Bit 3 */
    word EMISC4      :1;                                       /* EMISC Bit 4 */
    word EMISC5      :1;                                       /* EMISC Bit 5 */
    word EMISC6      :1;                                       /* EMISC Bit 6 */
    word EMISC7      :1;                                       /* EMISC Bit 7 */
    word EMISC8      :1;                                       /* EMISC Bit 8 */
    word EMISC9      :1;                                       /* EMISC Bit 9 */
    word EMISC10     :1;                                       /* EMISC Bit 10 */
    word             :1; 
    word             :1; 
    word INDEX0      :1;                                       /* Miscellaneous Index Bit 0 */
    word INDEX1      :1;                                       /* Miscellaneous Index Bit 1 */
    word INDEX2      :1;                                       /* Miscellaneous Index Bit 2 */
  } Bits;
  struct {
    word grpEMISC :11;
    word         :1;
    word         :1;
    word grpINDEX :3;
  } MergedBits;
} EMISCSTR;
extern volatile EMISCSTR _EMISC @(REG_BASE + 0x0000016EUL);
#define EMISC                           _EMISC.Word
#define EMISC_EMISC0                    _EMISC.Bits.EMISC0
#define EMISC_EMISC1                    _EMISC.Bits.EMISC1
#define EMISC_EMISC2                    _EMISC.Bits.EMISC2
#define EMISC_EMISC3                    _EMISC.Bits.EMISC3
#define EMISC_EMISC4                    _EMISC.Bits.EMISC4
#define EMISC_EMISC5                    _EMISC.Bits.EMISC5
#define EMISC_EMISC6                    _EMISC.Bits.EMISC6
#define EMISC_EMISC7                    _EMISC.Bits.EMISC7
#define EMISC_EMISC8                    _EMISC.Bits.EMISC8
#define EMISC_EMISC9                    _EMISC.Bits.EMISC9
#define EMISC_EMISC10                   _EMISC.Bits.EMISC10
#define EMISC_INDEX0                    _EMISC.Bits.INDEX0
#define EMISC_INDEX1                    _EMISC.Bits.INDEX1
#define EMISC_INDEX2                    _EMISC.Bits.INDEX2
#define EMISC_EMISC                     _EMISC.MergedBits.grpEMISC
#define EMISC_INDEX                     _EMISC.MergedBits.grpINDEX

#define EMISC_EMISC0_MASK               0x01U
#define EMISC_EMISC1_MASK               0x02U
#define EMISC_EMISC2_MASK               0x04U
#define EMISC_EMISC3_MASK               0x08U
#define EMISC_EMISC4_MASK               0x10U
#define EMISC_EMISC5_MASK               0x20U
#define EMISC_EMISC6_MASK               0x40U
#define EMISC_EMISC7_MASK               0x80U
#define EMISC_EMISC8_MASK               0x0100U
#define EMISC_EMISC9_MASK               0x0200U
#define EMISC_EMISC10_MASK              0x0400U
#define EMISC_INDEX0_MASK               0x2000U
#define EMISC_INDEX1_MASK               0x4000U
#define EMISC_INDEX2_MASK               0x8000U
#define EMISC_EMISC_MASK                0x07FFU
#define EMISC_EMISC_BITNUM              0x00U
#define EMISC_INDEX_MASK                0xE000U
#define EMISC_INDEX_BITNUM              0x0DU


/*** PTT - Port T I/O Register; 0x00000240 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTT4        :1;                                       /* Port T Bit 4 */
    byte PTT5        :1;                                       /* Port T Bit 5 */
    byte PTT6        :1;                                       /* Port T Bit 6 */
    byte PTT7        :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTT_4 :4;
  } MergedBits;
} PTTSTR;
extern volatile PTTSTR _PTT @(REG_BASE + 0x00000240UL);
#define PTT                             _PTT.Byte
#define PTT_PTT4                        _PTT.Bits.PTT4
#define PTT_PTT5                        _PTT.Bits.PTT5
#define PTT_PTT6                        _PTT.Bits.PTT6
#define PTT_PTT7                        _PTT.Bits.PTT7
#define PTT_PTT_4                       _PTT.MergedBits.grpPTT_4

#define PTT_PTT4_MASK                   0x10U
#define PTT_PTT5_MASK                   0x20U
#define PTT_PTT6_MASK                   0x40U
#define PTT_PTT7_MASK                   0x80U
#define PTT_PTT_4_MASK                  0xF0U
#define PTT_PTT_4_BITNUM                0x04U


/*** PTIT - Port T Input Register; 0x00000241 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte PTIT4       :1;                                       /* Port T Bit 4 */
    byte PTIT5       :1;                                       /* Port T Bit 5 */
    byte PTIT6       :1;                                       /* Port T Bit 6 */
    byte PTIT7       :1;                                       /* Port T Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpPTIT_4 :4;
  } MergedBits;
} PTITSTR;
extern volatile PTITSTR _PTIT @(REG_BASE + 0x00000241UL);
#define PTIT                            _PTIT.Byte
#define PTIT_PTIT4                      _PTIT.Bits.PTIT4
#define PTIT_PTIT5                      _PTIT.Bits.PTIT5
#define PTIT_PTIT6                      _PTIT.Bits.PTIT6
#define PTIT_PTIT7                      _PTIT.Bits.PTIT7
#define PTIT_PTIT_4                     _PTIT.MergedBits.grpPTIT_4

#define PTIT_PTIT4_MASK                 0x10U
#define PTIT_PTIT5_MASK                 0x20U
#define PTIT_PTIT6_MASK                 0x40U
#define PTIT_PTIT7_MASK                 0x80U
#define PTIT_PTIT_4_MASK                0xF0U
#define PTIT_PTIT_4_BITNUM              0x04U


/*** DDRT - Port T Data Direction Register; 0x00000242 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte DDRT4       :1;                                       /* Data Direction Port T Bit 4 */
    byte DDRT5       :1;                                       /* Data Direction Port T Bit 5 */
    byte DDRT6       :1;                                       /* Data Direction Port T Bit 6 */
    byte DDRT7       :1;                                       /* Data Direction Port T Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpDDRT_4 :4;
  } MergedBits;
} DDRTSTR;
extern volatile DDRTSTR _DDRT @(REG_BASE + 0x00000242UL);
#define DDRT                            _DDRT.Byte
#define DDRT_DDRT4                      _DDRT.Bits.DDRT4
#define DDRT_DDRT5                      _DDRT.Bits.DDRT5
#define DDRT_DDRT6                      _DDRT.Bits.DDRT6
#define DDRT_DDRT7                      _DDRT.Bits.DDRT7
#define DDRT_DDRT_4                     _DDRT.MergedBits.grpDDRT_4

#define DDRT_DDRT4_MASK                 0x10U
#define DDRT_DDRT5_MASK                 0x20U
#define DDRT_DDRT6_MASK                 0x40U
#define DDRT_DDRT7_MASK                 0x80U
#define DDRT_DDRT_4_MASK                0xF0U
#define DDRT_DDRT_4_BITNUM              0x04U


/*** RDRT - Port T Reduced Drive Register; 0x00000243 ***/
typedef union {
  byte Byte;
  struct {
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte RDRT4       :1;                                       /* Reduced Drive Port T Bit 4 */
    byte RDRT5       :1;                                       /* Reduced Drive Port T Bit 5 */
    byte RDRT6       :1;                                       /* Reduced Drive Port T Bit 6 */
    byte RDRT7       :1;                                       /* Reduced Drive Port T Bit 7 */
  } Bits;
  struct {
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte grpRDRT_4 :4;
  } MergedBits;
} RDRTSTR;
extern volatile RDRTSTR _RDRT @(REG_BASE + 0x00000243UL);
#define RDRT                            _RDRT.Byte
#define RDRT_RDRT4                      _RDRT.Bits.RDRT4
#define RDRT_RDRT5                      _RDRT.Bits.RDRT5
#define RDRT_RDRT6                      _RDRT.Bits.RDRT6
#define RDRT_RDRT7                      _RDRT.Bits.RDRT7
#define RDRT_RDRT_4                     _RDRT.MergedBits.grpRDRT_4

#define RDRT_RDRT4_MASK                 0x10U
#define RDRT_RDRT5_MASK                 0x20U
#define RDRT_RDRT6_MASK                 0x40U
#define RDRT_RDRT7_MASK                 0x80U
#define RDRT_RDRT_4_MASK                0xF0U
#define RDRT_RDRT_4_BITNUM              0x04U


