tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
extern volatile RDRGSTR _RDRG @(REG_BASE + 0x00000253UL);
#define RDRG                            _RDRG.Byte
#define RDRG_RDRG0                      _RDRG.Bits.RDRG0
#define RDRG_RDRG1                      _RDRG.Bits.RDRG1
#define RDRG_RDRG2                      _RDRG.Bits.RDRG2
#define RDRG_RDRG3                      _RDRG.Bits.RDRG3
#define RDRG_RDRG4                      _RDRG.Bits.RDRG4
#define RDRG_RDRG5                      _RDRG.Bits.RDRG5
#define RDRG_RDRG6                      _RDRG.Bits.RDRG6
#define RDRG_RDRG7                      _RDRG.Bits.RDRG7

#define RDRG_RDRG0_MASK                 0x01U
#define RDRG_RDRG1_MASK                 0x02U
#define RDRG_RDRG2_MASK                 0x04U
#define RDRG_RDRG3_MASK                 0x08U
#define RDRG_RDRG4_MASK                 0x10U
#define RDRG_RDRG5_MASK                 0x20U
#define RDRG_RDRG6_MASK                 0x40U
#define RDRG_RDRG7_MASK                 0x80U


/*** PERG - Port G Pull Device Enable Register; 0x00000254 ***/
typedef union {
  byte Byte;
  struct {
    byte PERG0       :1;                                       /* Pull Device Enable Port G Bit 0 */
    byte PERG1       :1;                                       /* Pull Device Enable Port G Bit 1 */
    byte PERG2       :1;                                       /* Pull Device Enable Port G Bit 2 */
    byte PERG3       :1;                                       /* Pull Device Enable Port G Bit 3 */
    byte PERG4       :1;                                       /* Pull Device Enable Port G Bit 4 */
    byte PERG5       :1;                                       /* Pull Device Enable Port G Bit 5 */
    byte PERG6       :1;                                       /* Pull Device Enable Port G Bit 6 */
    byte PERG7       :1;                                       /* Pull Device Enable Port G Bit 7 */
  } Bits;
} PERGSTR;
extern volatile PERGSTR _PERG @(REG_BASE + 0x00000254UL);
#define PERG                            _PERG.Byte
#define PERG_PERG0                      _PERG.Bits.PERG0
#define PERG_PERG1                      _PERG.Bits.PERG1
#define PERG_PERG2                      _PERG.Bits.PERG2
#define PERG_PERG3                      _PERG.Bits.PERG3
#define PERG_PERG4                      _PERG.Bits.PERG4
#define PERG_PERG5                      _PERG.Bits.PERG5
#define PERG_PERG6                      _PERG.Bits.PERG6
#define PERG_PERG7                      _PERG.Bits.PERG7

#define PERG_PERG0_MASK                 0x01U
#define PERG_PERG1_MASK                 0x02U
#define PERG_PERG2_MASK                 0x04U
#define PERG_PERG3_MASK                 0x08U
#define PERG_PERG4_MASK                 0x10U
#define PERG_PERG5_MASK                 0x20U
#define PERG_PERG6_MASK                 0x40U
#define PERG_PERG7_MASK                 0x80U


/*** PPSG - Port G Polarity Select Register; 0x00000255 ***/
typedef union {
  byte Byte;
  struct {
    byte PPSG0       :1;                                       /* Pull Select Port G Bit 0 */
    byte PPSG1       :1;                                       /* Pull Select Port G Bit 1 */
    byte PPSG2       :1;                                       /* Pull Select Port G Bit 2 */
    byte PPSG3       :1;                                       /* Pull Select Port G Bit 3 */
    byte PPSG4       :1;                                       /* Pull Select Port G Bit 4 */
    byte PPSG5       :1;                                       /* Pull Select Port G Bit 5 */
    byte PPSG6       :1;                                       /* Pull Select Port G Bit 6 */
    byte PPSG7       :1;                                       /* Pull Select Port G Bit 7 */
  } Bits;
} PPSGSTR;
extern volatile PPSGSTR _PPSG @(REG_BASE + 0x00000255UL);
#define PPSG                            _PPSG.Byte
#define PPSG_PPSG0                      _PPSG.Bits.PPSG0
#define PPSG_PPSG1                      _PPSG.Bits.PPSG1
#define PPSG_PPSG2                      _PPSG.Bits.PPSG2
#define PPSG_PPSG3                      _PPSG.Bits.PPSG3
#define PPSG_PPSG4                      _PPSG.Bits.PPSG4
#define PPSG_PPSG5                      _PPSG.Bits.PPSG5
#define PPSG_PPSG6                      _PPSG.Bits.PPSG6
#define PPSG_PPSG7                      _PPSG.Bits.PPSG7

#define PPSG_PPSG0_MASK                 0x01U
#define PPSG_PPSG1_MASK                 0x02U
#define PPSG_PPSG2_MASK                 0x04U
#define PPSG_PPSG3_MASK                 0x08U
#define PPSG_PPSG4_MASK                 0x10U
#define PPSG_PPSG5_MASK                 0x20U
#define PPSG_PPSG6_MASK                 0x40U
#define PPSG_PPSG7_MASK                 0x80U


/*** PIEG - Port G Interrupt Enable Register; 0x00000256 ***/
typedef union {
  byte Byte;
  struct {
    byte PIEG0       :1;                                       /* Interrupt Enable Port G Bit 0 */
    byte PIEG1       :1;                                       /* Interrupt Enable Port G Bit 1 */
    byte PIEG2       :1;                                       /* Interrupt Enable Port G Bit 2 */
    byte PIEG3       :1;                                       /* Interrupt Enable Port G Bit 3 */
    byte PIEG4       :1;                                       /* Interrupt Enable Port G Bit 4 */
    byte PIEG5       :1;                                       /* Interrupt Enable Port G Bit 5 */
    byte PIEG6       :1;                                       /* Interrupt Enable Port G Bit 6 */
    byte PIEG7       :1;                                       /* Interrupt Enable Port G Bit 7 */
  } Bits;
} PIEGSTR;
extern volatile PIEGSTR _PIEG @(REG_BASE + 0x00000256UL);
#define PIEG                            _PIEG.Byte
#define PIEG_PIEG0                      _PIEG.Bits.PIEG0
#define PIEG_PIEG1                      _PIEG.Bits.PIEG1
#define PIEG_PIEG2                      _PIEG.Bits.PIEG2
#define PIEG_PIEG3                      _PIEG.Bits.PIEG3
#define PIEG_PIEG4                      _PIEG.Bits.PIEG4
#define PIEG_PIEG5                      _PIEG.Bits.PIEG5
#define PIEG_PIEG6                      _PIEG.Bits.PIEG6
#define PIEG_PIEG7                      _PIEG.Bits.PIEG7

#define PIEG_PIEG0_MASK                 0x01U
#define PIEG_PIEG1_MASK                 0x02U
#define PIEG_PIEG2_MASK                 0x04U
#define PIEG_PIEG3_MASK                 0x08U
#define PIEG_PIEG4_MASK                 0x10U
#define PIEG_PIEG5_MASK                 0x20U
#define PIEG_PIEG6_MASK                 0x40U
#define PIEG_PIEG7_MASK                 0x80U


