tomaszmat/c_sharp/c.c++/NXP/MC9S12NE64CPV/cik1/cik1/CODE/IO_Map.h
/*** PIFG - Port G Interrupt Flag Register; 0x00000257 ***/
typedef union {
  byte Byte;
  struct {
    byte PIFG0       :1;                                       /* Interrupt Flags Port G Bit 0 */
    byte PIFG1       :1;                                       /* Interrupt Flags Port G Bit 1 */
    byte PIFG2       :1;                                       /* Interrupt Flags Port G Bit 2 */
    byte PIFG3       :1;                                       /* Interrupt Flags Port G Bit 3 */
    byte PIFG4       :1;                                       /* Interrupt Flags Port G Bit 4 */
    byte PIFG5       :1;                                       /* Interrupt Flags Port G Bit 5 */
    byte PIFG6       :1;                                       /* Interrupt Flags Port G Bit 6 */
    byte PIFG7       :1;                                       /* Interrupt Flags Port G Bit 7 */
  } Bits;
} PIFGSTR;
extern volatile PIFGSTR _PIFG @(REG_BASE + 0x00000257UL);
#define PIFG                            _PIFG.Byte
#define PIFG_PIFG0                      _PIFG.Bits.PIFG0
#define PIFG_PIFG1                      _PIFG.Bits.PIFG1
#define PIFG_PIFG2                      _PIFG.Bits.PIFG2
#define PIFG_PIFG3                      _PIFG.Bits.PIFG3
#define PIFG_PIFG4                      _PIFG.Bits.PIFG4
#define PIFG_PIFG5                      _PIFG.Bits.PIFG5
#define PIFG_PIFG6                      _PIFG.Bits.PIFG6
#define PIFG_PIFG7                      _PIFG.Bits.PIFG7

#define PIFG_PIFG0_MASK                 0x01U
#define PIFG_PIFG1_MASK                 0x02U
#define PIFG_PIFG2_MASK                 0x04U
#define PIFG_PIFG3_MASK                 0x08U
#define PIFG_PIFG4_MASK                 0x10U
#define PIFG_PIFG5_MASK                 0x20U
#define PIFG_PIFG6_MASK                 0x40U
#define PIFG_PIFG7_MASK                 0x80U


/*** PTH - Port H I/O Register; 0x00000258 ***/
typedef union {
  byte Byte;
  struct {
    byte PTH0        :1;                                       /* Port H Bit 0 */
    byte PTH1        :1;                                       /* Port H Bit 1 */
    byte PTH2        :1;                                       /* Port H Bit 2 */
    byte PTH3        :1;                                       /* Port H Bit 3 */
    byte PTH4        :1;                                       /* Port H Bit 4 */
    byte PTH5        :1;                                       /* Port H Bit 5 */
    byte PTH6        :1;                                       /* Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTH  :7;
    byte         :1;
  } MergedBits;
} PTHSTR;
extern volatile PTHSTR _PTH @(REG_BASE + 0x00000258UL);
#define PTH                             _PTH.Byte
#define PTH_PTH0                        _PTH.Bits.PTH0
#define PTH_PTH1                        _PTH.Bits.PTH1
#define PTH_PTH2                        _PTH.Bits.PTH2
#define PTH_PTH3                        _PTH.Bits.PTH3
#define PTH_PTH4                        _PTH.Bits.PTH4
#define PTH_PTH5                        _PTH.Bits.PTH5
#define PTH_PTH6                        _PTH.Bits.PTH6
#define PTH_PTH                         _PTH.MergedBits.grpPTH

#define PTH_PTH0_MASK                   0x01U
#define PTH_PTH1_MASK                   0x02U
#define PTH_PTH2_MASK                   0x04U
#define PTH_PTH3_MASK                   0x08U
#define PTH_PTH4_MASK                   0x10U
#define PTH_PTH5_MASK                   0x20U
#define PTH_PTH6_MASK                   0x40U
#define PTH_PTH_MASK                    0x7FU
#define PTH_PTH_BITNUM                  0x00U


/*** PTIH - Port H Input Register; 0x00000259 ***/
typedef union {
  byte Byte;
  struct {
    byte PTIH0       :1;                                       /* Port H Bit 0 */
    byte PTIH1       :1;                                       /* Port H Bit 1 */
    byte PTIH2       :1;                                       /* Port H Bit 2 */
    byte PTIH3       :1;                                       /* Port H Bit 3 */
    byte PTIH4       :1;                                       /* Port H Bit 4 */
    byte PTIH5       :1;                                       /* Port H Bit 5 */
    byte PTIH6       :1;                                       /* Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpPTIH :7;
    byte         :1;
  } MergedBits;
} PTIHSTR;
extern volatile PTIHSTR _PTIH @(REG_BASE + 0x00000259UL);
#define PTIH                            _PTIH.Byte
#define PTIH_PTIH0                      _PTIH.Bits.PTIH0
#define PTIH_PTIH1                      _PTIH.Bits.PTIH1
#define PTIH_PTIH2                      _PTIH.Bits.PTIH2
#define PTIH_PTIH3                      _PTIH.Bits.PTIH3
#define PTIH_PTIH4                      _PTIH.Bits.PTIH4
#define PTIH_PTIH5                      _PTIH.Bits.PTIH5
#define PTIH_PTIH6                      _PTIH.Bits.PTIH6
#define PTIH_PTIH                       _PTIH.MergedBits.grpPTIH

#define PTIH_PTIH0_MASK                 0x01U
#define PTIH_PTIH1_MASK                 0x02U
#define PTIH_PTIH2_MASK                 0x04U
#define PTIH_PTIH3_MASK                 0x08U
#define PTIH_PTIH4_MASK                 0x10U
#define PTIH_PTIH5_MASK                 0x20U
#define PTIH_PTIH6_MASK                 0x40U
#define PTIH_PTIH_MASK                  0x7FU
#define PTIH_PTIH_BITNUM                0x00U


/*** DDRH - Port H Data Direction Register; 0x0000025A ***/
typedef union {
  byte Byte;
  struct {
    byte DDRH0       :1;                                       /* Data Direction Port H Bit 0 */
    byte DDRH1       :1;                                       /* Data Direction Port H Bit 1 */
    byte DDRH2       :1;                                       /* Data Direction Port H Bit 2 */
    byte DDRH3       :1;                                       /* Data Direction Port H Bit 3 */
    byte DDRH4       :1;                                       /* Data Direction Port H Bit 4 */
    byte DDRH5       :1;                                       /* Data Direction Port H Bit 5 */
    byte DDRH6       :1;                                       /* Data Direction Port H Bit 6 */
    byte             :1; 
  } Bits;
  struct {
    byte grpDDRH :7;
    byte         :1;
  } MergedBits;
} DDRHSTR;
extern volatile DDRHSTR _DDRH @(REG_BASE + 0x0000025AUL);
#define DDRH                            _DDRH.Byte
#define DDRH_DDRH0                      _DDRH.Bits.DDRH0
#define DDRH_DDRH1                      _DDRH.Bits.DDRH1
#define DDRH_DDRH2                      _DDRH.Bits.DDRH2
#define DDRH_DDRH3                      _DDRH.Bits.DDRH3
#define DDRH_DDRH4                      _DDRH.Bits.DDRH4
#define DDRH_DDRH5                      _DDRH.Bits.DDRH5
#define DDRH_DDRH6                      _DDRH.Bits.DDRH6
#define DDRH_DDRH                       _DDRH.MergedBits.grpDDRH

